source/20231126T003942--emacs-in-daemon-mode__emacs.org
#+title:      emacs in daemon mode
#+date:       [2023-11-26 Sun 00:39]
#+filetags:   :emacs:
#+identifier: 20231126T003942

[[https://www.youtube.com/watch?v=ZjCRxAMPdNc&ab_channel=SystemCrafters][link ofc]]

alot of the times config can get big and take 3-5 or even 1-sec to
load.

the most important commands:
- emacs --deamon
- OR
- emacs --fg-deamon (only run foreground process)
- ~C-h v server-socket-dir~ (shows where the server is running)
- ls /run/user/1000/emacs
- ~emacsclient -c -n~ (no wait)
- ~emacsclient -e "(kill-emacs)"~ kill the daemon server if you want to
  reload the congif
